1 / 7 Есть ли в учебной базе данных dvd-rental таблицы с ограничением первичного ключа из двух полей и сколько их? Перечислите их. 


2 / 7 Какое поле в таблице customer еще можно было бы использовать в качестве первичного ключа вместо customer_id?


3 / 7 Каким запросом можно получить все записи по всем колонкам из таблицы rental?


4 / 7
Что из этого можно представить в виде реляционной базы данных?
 - Медицинский журнал
 - Расписание лекций в университете
 - Штат сотрудников
 - Все перечисленное

5 / 7 Сколько таблиц в схеме Public имеет больше всего связей? (ограничений внешних ключей плюс значений, на которые ссылаются внешние ключи из других таблиц). Перечислите их. 


6 / 7 Какая таблица в учебной базе данных dvd-rental имеет больше всего записей? 
# select count(*) from table_name

 - payment
 - film
 - rental
 - customer

7 / 7
Какой тип данных получится при выполнении запроса: 
select pg_typeof(r.rental_date::char) from rental r

--======== ОСНОВНАЯ ЧАСТЬ ==============

-- ЗАДАНИЕ №1
-- Выведите названия всех городов из таблицы городов. 
-- Посчитайте количество записей.
-- Выведите уникальные названия городов из таблицы городов.
-- Посчитайте количество уникальных записей. 

select distinct city
from city
order by city 

select count(distinct city)
from city

select city
from city
order by city

select count(city)
from city

-- ЗАДАНИЕ №2 
--Выведите следующую информацию по покупателям:
--  1. Фамилия и имя (в одной колонке через пробел)
--  2. Электронная почта
--  3. Длину значения поля email
--  4. Дату последнего обновления записи о покупателе (без времени)
--Каждой колонке задайте наименование на русском языке.

select customer_id as Номер, first_name || ' ' || last_name as Имя_Фамилия, email as Почта, length(email) as Колво_символов, max(last_update::date) as Последнее_обновление
from customer
group by customer_id
order by Имя_Фамилия

-- ЗАДАНИЕ №3
-- Выведите Email каждого покупателя, разделив значение Email на 2 отдельных колонки:
-- в первой колонке должно быть значение, указанное до @, 
-- во второй колонке должно быть значение, указанное после @.

select first_name || ' ' || last_name as Имя_Фамилия, split_part(email::text, '@'::text, 1) as Имя_Ящика, split_part(email::text, '@'::text, 2) as Доменное_Имя
from customer
order by Имя_Фамилия

-- ЗАДАНИЕ №4
--Доработайте запрос из предыдущего задания, скорректируйте значения в новых колонках: 
--первая буква строки должна быть заглавной, остальные строчными.

select initcap(first_name) || ' ' || initcap(last_name) as Имя_Фамилия, initcap(split_part(email::text, '@'::text, 1)) as Имя_Ящика, initcap(split_part(email::text, '@'::text, 2)) as Доменное_Имя
from customer
order by Имя_Фамилия

-- ЗАДАНИЕ №5 
-- Выбрать все записи из аренды, но взять две колонки: 
-- идентификатор аренды и колонку, значение в которой рассчитывается как 
-- разница между датой отгрузки и датой формирования заказа

select rental_id, date_trunc('day', return_date-rental_date) as rental_time
from rental